In [2]:
import pandas as pd

In [3]:
dataframe = pd.read_csv("ex1.csv")
dataframe

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
type(dataframe)

pandas.core.frame.DataFrame

In [5]:
type(dataframe["a"])

pandas.core.series.Series

In [6]:
dataframe["a"]

0    1
1    5
2    9
Name: a, dtype: int64

In [7]:
dataframe[["a","b"]]

   a   b
0  1   2
1  5   6
2  9  10

In [8]:
dataframe[["message","a","b"]]

  message  a   b
0   hello  1   2
1   world  5   6
2     foo  9  10

In [10]:
dataframe["message"][0]

'hello'

In [11]:
dataframe.iloc[0:1,:]

   a  b  c  d message
0  1  2  3  4   hello

In [13]:
dataframe["message"]

0    hello
1    world
2      foo
Name: message, dtype: object

In [15]:
dataframe1 = pd.read_csv("ex2.csv")
dataframe1

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [17]:
dataframe1 = pd.read_csv("ex2.csv",header = None)
dataframe1

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [20]:
dataframe1 = [["message","a","b","c","d"]]

In [21]:
dataframe1 = pd.read_csv("ex2.csv",header = None,names = ["a","b","c","d","e"])
dataframe1

   a   b   c   d      e
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [27]:
df2 = pd.read_excel("C:\\Users\\hp\\OneDrive\\Desktop\\New Microsoft Excel Worksheet.xlsx",engine = "openpyxl")
df2

   Marks  ID
0     65   1
1     23   2
2     67   3
3     67   4
4     89   5
5     89   6

In [ ]:
tsv = tab separated file(tsv = tab separated value)

In [29]:
df3 = pd.read_table("test.tsv")
df3

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [ ]:
df4 = pd.read_table